# Sample People Analytics Dataset

## Import Necessary Packages

In [74]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime
pd.options.display.max_rows = None
%matplotlib inline

## Dataframe Creation

In [47]:
employee_data = [
['E00001', '12/01', 25, 23],
['E00001', '12/02', 25, 21],
['E00001', '12/03', 30, 29],
['E00001', '01/04', 'NA', 20],
['E00001', '01/05', 30, 19],
['E00002', '12/01', 31, 17],
['E00002', '12/02', 33, 16],
['E00002', '12/03', 29, 16],
['E00003', '12/01', 25, 26],
['E00003', '12/02', 32, 27],
['E00003', '11/03', 28, 28],
['E00004', '11/01', 29, 27],
['E00004', '11/02', 27, 27],
['E00004', '11/03', 'NA', 25],
['E00004', '12/04', 25, 24],
['E00004', '12/05', 25, 23],
['E00004', '12/06', 29, 23],
['E00004', '12/07', 31, 23],
['E00005', '12/01', 25, 21],
['E00006', '12/02', 18, 16],
['E00006', '12/03', 19, 14],
['E00006', '01/01', 19, 19],
['E00007', '10/01', 24, 23]
]

In [48]:
manager_data = [
['M0001', 'E00001', 'USA'],
['M0001', 'E00002', 'USA'],
['M0001', 'E00003', 'USA'],
['M0002', 'E00004', 'USA'],
['M0002', 'E00005', 'USA'],
['M0002', 'E00006', 'USA'],
['M0003', 'E00007', 'IND'],
]

Create separate dataframes to store employee and manager information

In [49]:
emp_df = pd.DataFrame(employee_data, columns = ['employee_id','date','phone_calls','satisfied'])
manager_df = pd.DataFrame(manager_data, columns = ['manager_id','direct_report_id','country'])

## Table Preview

Employee table information

In [50]:
print("Table size: ", emp_df.shape, "\n")
print(emp_df.info())
emp_df.head()

Table size:  (23, 4)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 4 columns):
employee_id    23 non-null object
date           23 non-null object
phone_calls    23 non-null object
satisfied      23 non-null int64
dtypes: int64(1), object(3)
memory usage: 864.0+ bytes
None

  employee_id   date phone_calls  satisfied
0      E00001  12/01          25         23
1      E00001  12/02          25         21
2      E00001  12/03          30         29
3      E00001  01/04          NA         20
4      E00001  01/05          30         19

Manager table information

In [51]:
print("Table size: ", manager_df.shape, "\n")
print(manager_df.info())
manager_df.head()

Table size:  (7, 3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
manager_id          7 non-null object
direct_report_id    7 non-null object
country             7 non-null object
dtypes: object(3)
memory usage: 296.0+ bytes
None

  manager_id direct_report_id country
0      M0001           E00001     USA
1      M0001           E00002     USA
2      M0001           E00003     USA
3      M0002           E00004     USA
4      M0002           E00005     USA

## Data Cleaning

Convert "NA" values to nulls

In [52]:
emp_df = emp_df.replace("NA", np.nan)
emp_df.head()

  employee_id   date  phone_calls  satisfied
0      E00001  12/01         25.0         23
1      E00001  12/02         25.0         21
2      E00001  12/03         30.0         29
3      E00001  01/04          NaN         20
4      E00001  01/05         30.0         19

### Q4: Compute a column that imputes missing values with the average number of phone calls for that employee

In [54]:
# find records where values are null
# corresponds to employee E00001 and E00004
emp_df.loc[emp_df.phone_calls.isnull() == True]

   employee_id   date  phone_calls  satisfied
3       E00001  01/04          NaN         20
13      E00004  11/03          NaN         25

In [71]:
# impute the average for both records
emp_df.loc[3,'phone_calls'] = emp_df.loc[(emp_df.phone_calls.isnull() == False) & (emp_df.employee_id == 'E00001')].phone_calls.mean()
emp_df.loc[13,'phone_calls'] = emp_df.loc[(emp_df.phone_calls.isnull() == False) & (emp_df.employee_id == 'E00004')].phone_calls.mean()

In [72]:
# average is 27.5 for employee E00001
emp_df.loc[emp_df.index == 3]

  employee_id   date  phone_calls  satisfied
3      E00001  01/04         27.5         20

In [73]:
# average is 27.67 for employee E00004
emp_df.loc[emp_df.index == 13]

   employee_id   date  phone_calls  satisfied
13      E00004  11/03    27.666667         25

Display entire employee table again to check results:

In [75]:
emp_df

   employee_id   date  phone_calls  satisfied
0       E00001  12/01    25.000000         23
1       E00001  12/02    25.000000         21
2       E00001  12/03    30.000000         29
3       E00001  01/04    27.500000         20
4       E00001  01/05    30.000000         19
5       E00002  12/01    31.000000         17
6       E00002  12/02    33.000000         16
7       E00002  12/03    29.000000         16
8       E00003  12/01    25.000000         26
9       E00003  12/02    32.000000         27
10      E00003  11/03    28.000000         28
11      E00004  11/01    29.000000         27
12      E00004  11/02    27.000000         27
13      E00004  11/03    27.666667         25
14      E00004  12/04    25.000000         24
15      E00004  12/05    25.000000         23
16      E00004  12/06    29.000000         23
17      E00004  12/07    31.000000         23
18      E00005  12/01    25.000000         21
19      E00006  12/02    18.000000         16
20      E00006  12/03    19.000000         14
21      E00006  01/01    19.000000         19
22      E00007  10/01    24.000000         23

### Q1: Create a column that captures the daily satisfaction rate per employee

Assume daily satisfaction rate defined as number of satisfied clients/number of phone calls

In [76]:
emp_df['satisfaction_rate'] = round(emp_df.satisfied/emp_df.phone_calls, 2)
emp_df.head()

  employee_id   date  phone_calls  satisfied  satisfaction_rate
0      E00001  12/01         25.0         23               0.92
1      E00001  12/02         25.0         21               0.84
2      E00001  12/03         30.0         29               0.97
3      E00001  01/04         27.5         20               0.73
4      E00001  01/05         30.0         19               0.63

If we want to determine the average satisfaction rate per employee instead:

In [78]:
emp_df.groupby('employee_id').mean().satisfaction_rate

employee_id
E00001    0.818000
E00002    0.526667
E00003    0.960000
E00004    0.891429
E00005    0.840000
E00006    0.876667
E00007    0.960000
Name: satisfaction_rate, dtype: float64

### Q2: Compute a column that captures the average monthly satisfaction rate per employee

Assume average monthly satisfaction rate is average of monthly sum(satisfied)/sum(phone_calls)

In [80]:
# create a separate month column
emp_df['month'] = emp_df.date.apply(lambda x: x[:2])
emp_df.head()

  employee_id   date  phone_calls  satisfied  satisfaction_rate month
0      E00001  12/01         25.0         23               0.92    12
1      E00001  12/02         25.0         21               0.84    12
2      E00001  12/03         30.0         29               0.97    12
3      E00001  01/04         27.5         20               0.73    01
4      E00001  01/05         30.0         19               0.63    01

In [93]:
# create a dataframe of summed values per employee and month
agg = emp_df.groupby(['employee_id','month']).sum()[['satisfied','phone_calls']].sort_values(['employee_id','month'], ascending = [True,True])
agg

                   satisfied  phone_calls
employee_id month
E00001      01            39    57.500000
            12            73    80.000000
E00002      12            49    93.000000
E00003      11            28    28.000000
            12            53    57.000000
E00004      11            79    83.666667
            12            93   110.000000
E00005      12            21    25.000000
E00006      01            19    19.000000
            12            30    37.000000
E00007      10            23    24.000000

In [94]:
# satisfaction rates computed per month for each employee
agg['satisfaction_rate'] = round(agg.satisfied/agg.phone_calls, 2)
agg

                   satisfied  phone_calls  satisfaction_rate
employee_id month
E00001      01            39    57.500000               0.68
            12            73    80.000000               0.91
E00002      12            49    93.000000               0.53
E00003      11            28    28.000000               1.00
            12            53    57.000000               0.93
E00004      11            79    83.666667               0.94
            12            93   110.000000               0.85
E00005      12            21    25.000000               0.84
E00006      01            19    19.000000               1.00
            12            30    37.000000               0.81
E00007      10            23    24.000000               0.96

Finally, display average monthly satisfaction rates:

In [103]:
# finally, display average monthly satisfaction rates
agg.groupby('employee_id').mean()

             satisfied  phone_calls  satisfaction_rate
employee_id
E00001            56.0    68.750000              0.795
E00002            49.0    93.000000              0.530
E00003            40.5    42.500000              0.965
E00004            86.0    96.833333              0.895
E00005            21.0    25.000000              0.840
E00006            24.5    28.000000              0.905
E00007            23.0    24.000000              0.960

# String to datetime conversion

Convert date column in employee table to datetime

In [33]:
def convert_to_date(string):
    format = "%m/%d"
    new_date = datetime.datetime.strptime(string, format)
    return new_date

In [34]:
emp_df.date.apply(convert_to_date)

0    1900-12-01
1    1900-12-02
2    1900-12-03
3    1900-01-04
4    1900-01-05
5    1900-12-01
6    1900-12-02
7    1900-12-03
8    1900-12-01
9    1900-12-02
10   1900-11-03
11   1900-11-01
12   1900-11-02
13   1900-11-03
14   1900-12-04
15   1900-12-05
16   1900-12-06
17   1900-12-07
18   1900-12-01
19   1900-12-02
20   1900-12-03
21   1900-01-01
22   1900-10-01
Name: date, dtype: datetime64[ns]

In [39]:
pd.to_datetime('12/01/20')

Timestamp('2020-12-01 00:00:00')